SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460jeua_template/example/GCC/hc32f460jeua.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WDT</name>
            <description>desc WDT</description>
            <baseAddress>0x40049000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80010FF3</resetValue>
                    <resetMask>0x80010FF3</resetMask>
                    <fields>
                        <field>
                            <name>PERI</name>
                            <description>desc PERI</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>desc CKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDPT</name>
                            <description>desc WDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLPOFF</name>
                            <description>desc SLPOFF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITS</name>
                            <description>desc ITS</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UDF</name>
                            <description>desc UDF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REF</name>
                            <description>desc REF</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RR</name>
                    <description>desc RR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RF</name>
                            <description>desc RF</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>WKTM</name>
            <description>desc WKTM</description>
            <baseAddress>0x4004C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WKTMCMP</name>
                            <description>desc WKTMCMP</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKOVF</name>
                            <description>desc WKOVF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKCKS</name>
                            <description>desc WKCKS</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKTCE</name>
                            <description>desc WKTCE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
